--------------------------------------------------------------------------------
-- @module string
-- @desc 对string库的扩展
--------------------------------------------------------------------------------

local string = string

--------------------------------------------------------------------------------
-- 判断字符串是否以指定的字符串结尾
--------------------------------------------------------------------------------
function string.endwith(str, suffix)
    local str_suffix = string.sub(str, -1*string.len(suffix))
    return (str_suffix == suffix)
end

--------------------------------------------------------------------------------
-- 判断字符串是否以指定的字符串开头
--------------------------------------------------------------------------------
function string.beginwith(str, prefix)
    local str_prefix = string.sub(str, 1, string.len(prefix))
    return (str_prefix == prefix)
end


--------------------------------------------------------------------------------
-- 获得字符串最后一个字符
--------------------------------------------------------------------------------
function string.lastchar(str)
    return string.sub(str, -1)
end

--------------------------------------------------------------------------------
-- 获得字符串第一个字符
--------------------------------------------------------------------------------
function string.firstchar(str)
    return string.sub(str, 1, 1)
end

--------------------------------------------------------------------------------
-- 获得字符串中指定index的字符
--------------------------------------------------------------------------------
function string.at(str, index)
    return string.sub(str, index, index)
end

--------------------------------------------------------------------------------
-- 查找字符串中最后一个匹配的起始index
--------------------------------------------------------------------------------
function string.findlast(str, s)
    for i = string.len(str),  1, -1 do
        local tmp = string.sub(str, i, i+#s-1)
        if tmp == s then
            return i
        end
    end
end

--------------------------------------------------------------------------------
-- 将字符串转换为bool类型，如果不成功也返回false
--------------------------------------------------------------------------------
function string.tobool(str)
    local str = string.lower(tostring(str))
    if str == "yes" or str == "true" or str == "ok" then 
    	return true 
    end
    return false
end

--------------------------------------------------------------------------------
-- 在字符串开头补齐指定的字符，令字符串达到指定的长度
--------------------------------------------------------------------------------
function string.letprefix(str, len, c)
    local l = str:len()
    local d = len - l
    local s = string.rep(c or ' ', d)
    return s .. str
end

--------------------------------------------------------------------------------
-- 在字符串末尾补齐指定的字符，令字符串达到指定的长度
--------------------------------------------------------------------------------
function string.letsuffix(str, len, c)
    local l = str:len()
    local d = len - l
    local s = string.rep(c or ' ', d)
    return str .. s
end